---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCollection.Dispose
source: html/480e59b9-0250-f9ef-26a1-b713c8a4fd0d.htm
---
# Autodesk.Revit.DB.PointClouds.PointCollection.Dispose Method

Releases all resources used by the PointCollection

## Syntax (C#)
```csharp
public void Dispose()
```